The surface-based splitter intersects a face to be divided in multiple places and this case is not currently supported
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DividedSurfaceCuttingSurfaceMakesMultipleCuts { get; }
  Visual Basic
Public Shared ReadOnly Property DividedSurfaceCuttingSurfaceMakesMultipleCuts As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceCuttingSurfaceMakesMultipleCuts {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DividedSurfaceFailures Class
  Autodesk.Revit.DB Namespace